      ******************************************************************
      * ínï˚ÅB
      ******************************************************************
         11  REGIONS-COUNT               PIC 9(2).
         11  REGION                      OCCURS 10 INDEXED BY I.
           13  REGION-CODE               PIC X(2).
           13  REGION-NAME               PIC N(4).
           13  PREFECTURES-COUNT         PIC 9(2).
           13  PREFECTURE                OCCURS 10 INDEXED BY J.
             15  PREFECTURE-CODE         PIC X(2).
             15  PREFECTURE-NAME         PIC N(5).
