      ******************************************************************
      * ステージ。
      ******************************************************************
      *     行。
           11  ROW                     OCCURS  8.
      *         セル。
               13  CELL                OCCURS 10 PIC 9.
